{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "cropping": [[60, 20], [0, 0]], "batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "output_shape": [64, 64, 3], "batch_input_shape": [null, 80, 320, 3], "arguments": {}, "function": ["4wEAAAAAAAAAAwAAAAQAAABTAAAAczcAAABkAQBkAgBsAABtAQB9AQABfAEAagIAagMAfAAAZAYA\ngwIAfQIAfAIAZAQAG2QFABh9AgB8AgBTKQdO6QAAAAApAdoCdGbpQAAAAOcAAAAAAOBvQOcAAAAA\nAADgPykCcgMAAAByAwAAACkE2g1rZXJhcy5iYWNrZW5kcgIAAADaBWltYWdl2g1yZXNpemVfaW1h\nZ2VzKQNyBwAAANoDa3Rm2gdyZXNpemVkqQByCwAAAPoMbW9kZWxfc2ltLnB52hByZXNpemVfbm9y\nbWFsaXplZAAAAHMIAAAAAAEQBRUCDgI=\n", null, null]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "Conv1", "strides": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "filters": 24, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "name": "spatial_dropout2d_1", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "Conv2", "strides": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "filters": 36, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "name": "spatial_dropout2d_2", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "Conv3", "strides": [2, 2], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "filters": 48, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [5, 5], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "name": "spatial_dropout2d_3", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "Conv4", "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "name": "spatial_dropout2d_4", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "Conv5", "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 100, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 50, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 10, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "units": 1, "activation": "linear", "bias_regularizer": null}}]}, "backend": "tensorflow"}